# SQL Notes

## Vocabulary

- RDBMS: The software that manages the data, i.e. handles it's storage and retrieval. Runs the database server  
- Database: Sometimes used interchangably with a DBMS; The actual location of the data stored on disk; You won't interact with this directly, but rather, through the DBMS.  
- Database Client: a program that can be used to connect to a database. Each database usually comes with an officially sanctioned command line client, and there are many different GUI database clients as well.  
- Database Server: a computer that runs the DBMS and stores the data, typically either on-premises or in the cloud.  
- DDL: Data definition language; commands that change the structure of the database or the DBMS itself, or change the structure of tables in the database. We will not be focusing on this part of SQL.  
- DML: Data manipulation language; used to insert, update, delete, and retrieve information from databases. We will be focusing on the the retrieval part of this.

- Data Types:  
    -- `INT` : Any number without a decimal
    -- `FLOAT` : A number *with* a decimal point
    -- `DECIMAL` : A *precise* decimal number. A decimeal column has a defined length and a precision, which is the total number of digits after the decimal place. Example - A column defined as `DECIMAL (4, 2)` would have four digits total, two of those being after the decimal place.   
    -- `UNSIGNED` : When declaring a numeric column, we can specify that the values are `UNSIGNED`, meaning that there are only positive values. A normal `INT` column can store a number from `-2,147,483,684` to `2,147,483,684`, and an `INT UNSIGNED` stores from `0` to `4,294,967,295`  
    -- `BOOLEAN` : A `BOOLEAN` is generally either a `0` or a `1`, where `0` is `False` and `1` is `True`  
    
    -- `STRING TYPES` :
    
    -- `CHAR(length)` : A string with a fized number of characters, form 1 to 255. If a string stored under this method is les than 255, it is padded with empty space to take up the full size. Any more characters returns an error    
    -- `VARCHAR(length)` : For strings where the length could be anything up to some maximum number. Technically can go up to 65,535, but it is recommended that if you need to go beyond 255, you use `TEXT` instead    
    -- `TEXT` : A large block of characters that can be any length. There are some technical. limitations to `TEXT` that give it performance issues if abused, and should only be used for large blocks of text, like an entire article, or pages of a book  
    
    -- `DATE TYPES` :
    
    -- `DATE` : A date value without any time, usually displayed as `YYYY-MM-DD`  
    -- `TIME` : A time down to the scond, usually using 24 hour time.   
    -- `DATETIME` : A combined date and time value, doesn't store any time zone data and uses the `YYYY-MM-DD HH:MM:SS` format.   
    
    -- `NULL` : Null has a special meaning in databases; In most languages, a `NULL` acts as a 0, and actually is a 0 in some of them, but in SQL is technically the *absence of a value*

## Creating Tables

The syntax for creating a table is relatively simple:

```sql
CREATE TABLE quotes (
    author_first_name VARCHAR(50),
    author_last_name VARCHAR(100) NOT NULL, 
    content TEXT NOT NULL
);
```

Here we allowed the `author_first_name` to be null, but `author_last_name` and `content` are both mandatory. This example isn't quite complete, though. 

```sql
CREATE TABLE quotes (
    id INT UNSIGNED NOT NULL AUTO_INCREMENT,
    author_first_name VARCHAR(50),
    author_last_name  VARCHAR(100) NOT NULL,
    content TEXT NOT NULL,
    PRIMARY KEY (id)
);
```
In this, we've added a primaery key to our table, that being the id column. In a primary key column, each value must be unique, cannot be null, and there can only be one primary key in a table. We've added the commaned `AUTO_INCREMEMNT` so that the column starts at 1 and counts upward for each entry.  
Later on, when working with multiple tables in a database we'll find that a foreign key is a column in a table that is a primary key in another table within the database.

## Basic Functionality with Tables

To show a table within your SQL GUI, you will simply use the query:

```sql
SHOW TABLES;
```

You can also use: 

```sql
DESCRIBE table_name;
```

This gives some basic information on the table you're asking to be described, like column names, and their corrosponding data types, if they can contain `NULL` values, if they have a key value, ect.  

MySQL uses `EXPLAIN` and `DESCRIBE` interchangeably. By convention you would generally use `DESCRIBE` when inspecting a table, and `EXPLAIN` when analyzing a query.  
You can also use:

```sql
SHOW CREATE TABLE table_name;
```

This will show you the original code that was written to make the table.

## Basic Statements

To comment your code in SQL, there a few things you can use. For a single line, you'd use `#` or `--`, and for multiple lines you'd start with /* and end your comment with */

```sql

#Like this

-- Or this

/* 
Or
Like
This
*/
```

Use `SELECT` to find and return rows from specific columns with your table or tables. You can use a `*` to tell SQL that you want every column from a table.   
Use `FROM` to tell SQL where the informatiomn in your `SELECT` is coming from.  
Every statement *needs* a `SELECT` and `FROM`.

Example:

```sql
SELECT column1, column2
FROM table_name;
```

Using the `SELECT DISTINCT` statement will eliminate all duplicate values from the output.  
You can also use a `WHERE` clause to filter your ouput by specifying a condition that has to be true for any given row to be displayed.  

Example:

```sql
SELECT *
FROM table_name
WHERE id >= 7;
```

### Operators

Basic operators are pretty self explanatory:
- `=` equal
- `!=` or `<>` not equal
- `<` less than
- `>` greater than
- `<=` less than or equal to
- `>=` greater than or equal to
- `BETWEEN value1 AND value2` greater than or equal to value 1 and less than or equal to value 2

All of these can be used as part of a `WHERE` clause, or even with a `SELECT`. Using these with `SELECT` will return a boolean value, telling you whether the staement is true or false.

### Misc Output and Aliases

Sometimes it's useful to output some arbitrary data from a SQL script.

Example:
```sql
SELECT 'I am output!' AS Info;
```

This will give us a very basic table with the column name `Info` and the row stating 'I am output!'

You can `ALIAS` a table, column, or miscellaneous piece of a query. If the name contains spaces, you must enclose it in quotes `''`. Otherwise, they're not needed. Since aliases are normally used for efficiency, best practice is to use an underscore rather than a space.

An example would be:

```sql
SELECT 1 + 1 AS two;
```

This would return something like this:

+-----+  
| two |  
+-----+  
|   2 |  
+-----+  

Or: 

```sql
SELECT id, name AS low_quantity_fruit, 
       quantity AS inventory
FROM fruits
WHERE quantity < 4;
```

## Slightly more Advanced Statements

### `WHERE` Clauses

As mentioned above, the `WHERE` clause can filter the output of the SQL query.  
You can use `AND` and `OR`, or even comparision operators to add layers of complexity to the statement.  

Examples:

```sql
SELECT *
FROM table_name
WHERE hire_date = '1985-01-01';

SELECT *
FROM table_name
WHERE hire_date < '9999-01-01';

SELECT *
FROM table_name 
WHERE emp_no >= 11000;
```

You can use `LIKE` to find similarities instead of exact matches. You would use it with a `%`, which is known as a wildcard. The wildcard can be in front of, at the end of, or on both ends of a statement to determine how you want to specify your filter. If the wildcard precedes the filter, like this: `'%i'`, it will return anything that ends with an 'i'. The opposite, `'i%'`, would return anything that begins with an 'i'. Alternatively, you could simply have a wildcard on either side of a filter, like below:

```sql
SELECT *
FROM employees
WHERE first_name LIKE '%sus%';
```

You can use `AND` and `OR` to filter based on one or more statements being true or false, like below:

```sql
SELECT *
FROM table_name
WHERE emp_no BETWEEN 10026 AND 10055;
```

```sql
SELECT *
FROM table_name
WHERE emp_no 10026 OR 10055;
```

You can even return everything from within a list, using the `IN` clause:

```sql
SELECT *
FROM table_name
WHERE last_name IN ('Brown', 'Granger', 'Solo', 'Baggins');
```

You can also check to see if values are `NULL` or `NOT NULL`, like so:

```sql
SELECT *
FROM table_name
WHERE to_date IS NOT NULL;
```

Or the inverse:

```sql
SELECT *
FROM table_name
WHERE to_date IS NULL;
```

To get more complex or complete results, you can chain together `WHERE` clauses:

```sql
SELECT *
FROM table_name
WHERE last_name IN ('Brown', 'Granger')
    AND emp_no < 20000;
```

You can force evaluation grouping using `()`:

```sql
SELECT * 
FROM table_name
WHERE emp_no < 20000
    AND (
        last_name IN ('Brown', 'Granger')
    OR first_name = 'Hermione'
        );
```

### `ORDER BY` Clauses

`ORDER BY` does exactly that, orders your results by something you specify:

```sql
SELECT first_name, last_name,
FROM table_name
ORDER BY last_name;
```

The default sort order is ascending, but you can specify if you'd like:

```sql
SELECT first_name, last_name
FROM table_name
ORDER BY last_name DESC;
```

You *can* specify `ASC`, but as that's the default, there's no need unless you want it for clarity's sake. You can also chain `ORDER BY` clauses like so:

```sql
SELECT first_name, last_name
FROM table_name
ORDER BY last_name DESC, first_name ASC;
```

### `LIMIT` Clauses

`LIMIT` is simple, it just limits your ouput. It is also the very last thing in your SQL statement:

```sql
SELECT *
FROM table_name
LIMIT 100;
```

The one other thing with a `LIMIT` is `OFFSET`. `OFFSET` tells sql which row to start with. It's most often used for pagination, or creating pages of data. It looks like this:

```sql
SELECT * 
FROM table_name
WHERE first_name LIKE 'M%'
LIMIT 25 OFFSET 50;
```

## Functions

MySQL has a lot of built-in functions and functionality we can use. We're only going over a selection of important functions in class, so that's what I'll include here:

String Functions:

- `CONCAT`
- `LIKE` and `NOT LIKE`
- `SUBSTR`
- Case conversion with `UPPER` and `LOWER` 
- `REPLACE`

Date and Time Functions:

- `NOW`
- `CURDATE`
- `CURTIME`
- `UNIX TIMESTAMP()`

Numerial Functions:

- `AVG`
- `MIN`
- `MAX`

Casting:

- Casting technically isn't a function call, but it's related. You can cast one data type to another. For the most part, SQL will be able to tell if it's a number or string.

   ###  String Functions

`CONCAT()` takes in any number of columns names or string and concatenates them together:

```sql
SELECT CONCAT ("Hello ', 'Codeup', '!');
```

This will return something like this:

+---------------------------------+  
| CONCAT('Hello ', 'Codeup', '!') |  
+---------------------------------+  
| Hello Codeup!                   |  
+---------------------------------+

`LIKE`, as mentioned earlier, is used with `WHERE` to find similarites:

```sql
SELECT first_name
FROM table_name 
WHERE first_name LIKE '%sus%';
```

`NOT LIKE` will return results that do *not* match the pattern:

```sql
SELECT first_name
from table_name
WHERE first_name NOT LIKE '%a%';
```

This will return all first names without the letter 'a' in them.

`SUBSTR()` can extract a part of a string as a substring. You have to supply the string you're wanting to manipulate, the starting index, which is where in the string you want to start, and the length of the substring, or the number of characters to extract:

```sql
SELECT SUBSTR('abcdefghi', 2, 4);
```

This will take in the string 'abcdefghi', go to the second index, 'b', and from there take four characters, which will return 'bcde' in the end.

Case Conversion is rather self explanatory, `UPPER()` will convert everything to uppercase, and `LOWER()` will convert everything to lowercase. 

```sql
SELECT UPPER ('abcde'), LOWER ('ABCDE');
```

This would return something like this:

+----------------+----------------+  
| UPPER('abcde') | LOWER('ABCDE') |  
+----------------+----------------+  
| ABCDE          | abcde          |  
+----------------+----------------+  
1 row in set (0.09 sec)

`REPLACE()` lets you manipulate strings by replacing substrings. The general form for this looks like so:

REPLACE(subject, search, replacement)

```sql 
SELECT REPLACE('abcdefg', 'abc', '123');
```

This will return something like so:

+----------------------------------+  
| REPLACE('abcdefg', 'abc', '123') |  
+----------------------------------+  
| 123defg                          |  
+----------------------------------+  
1 row in set (0.05 sec)

### Date and Time Functions

`NOW()` returns the current time in a `YYYY-MM-DD HH:MM:SS` format

`CURDATE()` returns just the date and no time in the same format

`CURTIME()` does the same, but with the time

`UNIX TIMESTAMP()` is used to represent time as an integer. It counts the number of seconds since January 1st, 1970. If you pass a date time value to `UNIX TIMESTAMP()`, it gives you the number of seconds to that date.

```sql
SELECT CONCAT(
    'Teaching people to code for ',
    UNIX TIMESTAMP() - UNIX TIMESTAMP('2014-02-04'),
    'seconds'
    );
```

This will return something like this:

Teaching people to code for 280272040 seconds

### Numerical Functions

You can perform many commom mathematical operations on sequences in SQL. Some examples of use:

```sql
SELECT MIN(emp_no)
FROM table_name;
```

This will return the smallest employee number from the table

```sql
SELECT AVG(emp_no) 
FROM table_name;
```

This will return the average of the employee numbers from the table. Not particularly useful, in this case, but can be extremely useful.

```sql
SELECT MAX(emp_no)
FROM table_name;
```

This will return the highest employee number within the table.

## `GROUP BY` Clauses

Grouping results based on the data in columns will remove duplicates, like using `DISTINCT`, but it's more versatile. You can use `GROUP BY` in combination with aggregate functions.